// 1. შექმენით მასივი, რომლის საწყისი მნიშვნელობა იქნება რიცხვები: 5, 25, 89, 120, 36;

//   მასივის ბოლოში დაამატეთ ორი ელემენტი(სტრინგი): javascript და python;
//   მასივის დასაწყისში კი დაამატეთ ელემენტი(სტრინგი): html და css;
//   გამოიტანეთ ეკრანზე, რამდენი ელემენტი გაქვთ მასივში;
//   წაშალეთ მასივიდან პირველი და ბოლო ელემენტი;
//   დაბეჭდეთ მასივისი ახალი ელემენტები.

let numbers = [5, 25, 89, 120, 36]
numbers.push("javascript","python")
numbers.unshift("html","css")
console.log(numbers.length)
numbers.pop();
numbers.shift();
console.log(numbers);

// 2. შექმენით მასივი, შემდეგი ელემენტებით: ფორთოხალი, ბანანი, მსხალი;

//   გამოიტანეთ ინფორმაცია ეკრანზე თუ რამდენი ელემენტი გაქვთ მასივში;
//   მასივის ბოლოს დაამატეთ ორი ელემენტი: ვაშლი და ანანასი;
//   მასივის დასაწყისში კი დაამატეთ ელემენტი: საზამთრო;
//   გამოიტანეთ ეკრანზე, რამდენი ელემენტი გაქვთ მასივში;
//   მასივის მე-3 ადგილას დაამატეთ ელემენტი: მანგო;
//   წაშალეთ მასივიდან პირველი და ბოლო ელემენტი;
//   გამოიტანეთ ეკრანზე, თუ რამდენი ელემენტი დარჩა მასივში;
let fruit = ["ფორთოხალი","ბანანი", "მსხალი"]
console.log(fruit.length);
fruit.push('vashli','ananasi');
fruit.unshift('sazamtro');
fruit.splice(2,0,"mango")
fruit.pop();
fruit.shift();
console.log(fruit);
console.log(fruit.length);


// 3.მოცემულია მასივი let array =[1, 2, 3, 4, 5]. Splice მეთოდის საშუალებით მიიღეთ: [1, 2, 3, 'a', 'b', 'c', 4, 5].
let array =[1, 2, 3, 4, 5]
array.splice(3,0,'a','b','c')
console.log(array);

// 6. დაწერეთ ფუნქცია, რომელსაც პარამეტრად გადაეცემა ორი რიცხვი(ნებისმიერი ჩაწერეთ) და რომელიც შეასრულებს შემდეგ ლოგიკას:
// თუ პირველი რიცხვი მეტია მეორეზე დაიბეჭდოს - num1 is the largest; თუ მეორე რიცხვი მეტია პირველზე - დაიბეჭდოს num2 is the largest; ყველა სხვა დანარჩენ შემთხვევაში დაიბეჭდოს - error; 
function num(x,y){
    if(x > y){
        return "num1 is the largest"
    }else if(y > x){
        return "num2 is the largest"
    }else{
        return "error" 
    }
}
let numberResult = num(10,9);
console.log(numberResult);

// 7.  მოცემულია მასივი:
// map-ის გამოყენებით შექმენით ახალი მასივი, რომელშიც array მასივიდან თითოეული ელემენტი იქნება 3-ზე გაყოფილი
let array1 = [12, 25, 3, 6, 8, 14, 7, 23];
let array2 = array1.map(i => i/3)
console.log(array2);

// 9. მოცემულია მასივი:
// Let array=[2,15,10,24] წაშალეთ ამ
// მასივიდან რიცხვი 10;
let numb=[2,15,10,24]
numb.splice(2,1);
console.log(numb);

